C8/system/externalFunctionObject
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Absolute pressure calculation
pGaugePa
{
	type	pressure;
	libs	("libfieldFunctionObjects.so");

	log		true;
	field           p;
	result          pGaugePa;

	calcTotal       no;
	calcCoeff       no;

	rho             rhoInf;
	rhoInf          1.293;        // or 1.293 if you want physical air density

	executeControl  timeStep;
	executeInterval 1;
	writeControl    timeStep;
	writeInterval   1;
}

// Setting atmospheric reference pressure
pAtm
{
	type            uniform;
	libs            ("libfieldFunctionObjects.so");

	fieldType       volScalarField;
	field           pAtm;
	dimensions      [1 -1 -2 0 0 0 0];
	value           101325;

	executeControl  timeStep;
	executeInterval 1;
	writeControl    timeStep;
	writeInterval   1;
}

// Adding reference pressure to gauge pressure
pPa
{
	type            add;
	libs            ("libfieldFunctionObjects.so");

	fields          (pGaugePa pAtm);
	result          pPa;

	executeControl  timeStep;
	executeInterval 1;
	writeControl    timeStep;
	writeInterval   1;
}
